{
  "lang": "fr",
  "fullName": "Mario Arnautou-Pages",
  "job": "Ingénieur Informatique",
  "location": "Rhône-Alpes, France",
  "cv": [
    {
      "text": "Français",
      "href": "download/cv/fr"
    },
    {
      "text": "Anglais",
      "href": "download/cv/en"
    },
    {
      "text": "Espagnol",
      "href": "download/cv/es"
    }
  ],
  "social": [
    {
      "name": "linkedin",
      "url": "https://fr.linkedin.com/in/mario-arnautou-pages-722a51108"
    },
    {
      "name": "github",
      "url": "https://github.com/MarioArnt"
    },
    {
      "name": "codepen",
      "url": "http://codepen.io/MarioArnt"
    },
    {
      "name": "twitter",
      "url": "https://twitter.com/marioarnt"
    },
    {
      "name": "email",
      "anchor": "contact"
    },
    {
      "name": "phone",
      "modal": {
        "title": "Call me",
        "content": "<img src=\"images/phone.png\" />"
      }
    }
  ],
  "events": [
    {
      "type": "diploma",
      "title": "Obtention du Baccalauréat Scientifique.",
      "month": 7,
      "year": 2010,
      "period": "Juillet 2010",
      "location": "Pontcharra-sur-Bréda, France",
      "details": "Option Science et Vie de la Terre, mention Très bien"
    },
    {
      "type": "university",
      "title": "Entrée en classe préparatoire",
      "month": 9,
      "year": 2010,
      "period": "Septembre 2010",
      "location": "Grenoble, France",
      "details": "Option Physique et Chimie en deuxième année (PCSI/PC)",
      "more": "Formation scientifique générale et intensive pour la préparation au concours des grandes écoles d’ingénieurs. Donne de solides bases en mathématiques, physique, chimie et sciences de l’ingénieur dans des domaines variés."
    },
    {
      "type": "diploma",
      "title": "Concours grandes écoles",
      "month": 4,
      "year": 2012,
      "period": "Avril 2012 - Août 2012",
      "details": "Admissibilité aux concours Mines-Télécoms, Concours Commun Polytechniques et Centrale-Supéléc"
    },
    {
      "type": "university",
      "title": "Entrée à Télécom SudParis",
      "month": 9,
      "year": 2012,
      "period": "Septembre 2012 - Fevrier 2016",
      "location": "Evry, France",
      "details": "Grande école d’ingénieur IT généraliste, membre de l’institut Mines-Télécoms et de l’Université Paris-Saclay",
      "more": "<p>Déroulement du cursus :</p><ol><li>Tronc Commun (3 semestres) : Formation générale aux différents domaines utiles (Probabilités, Statistiques, Traitement de signal, Algorithmique, Programmation orienté objets, Analyse de données, Théorie de l’information, Electronique, Communications hyperfréquences)</li><li>Cours électifs (1 semestre) : Cours d’ouverture aux choix de l’étudiant. En ce qui me concerne, j’ai choisi les cours suivants : Algorithmique génétique, Méthodes formelles, Programmation bas niveau (langage assemblage) de systèmes autonomes, Principes physiques des capteurs électroniques, Identification radiofréquence. </li><li>Voie d’approfondissement (1 semestre) : Cours de spécialisation dans les domaines des systèmes embarqués, des objets communicants et de l’internet des objets : Conception de systèmes temps réel, ordonnancement, bus de communication (CAN, FlexRay, SPI, I2C), langage de description matériel (VHDL).</li><li>Stage de fin d’étude  (1 semestre)</li></ol>"
    },
    {
      "type": "project",
      "title": "Student Office Website Development",
      "month": 11,
      "year": 2012,
      "period": "Novembre 2012 - Fevrier 2013",
      "details": "Lors de la campagne pour l’élection du nouveau Bureau des Elèves de Télécom SudParis, j’ai développé un site internet vitrine pour ma liste",
      "anchor": "student-office-website"
    },
    {
      "type": "job",
      "title": "Enseignement de l’informatique",
      "month": 6,
      "year": 2013,
      "period": "Juin 2013",
      "location": "Envigado, Colombia",
      "details": "Dans le cadre du projet Gate, nous avons, avec trois camarades de Télécom SudParis, préparé et dispensé des cours de développement web et d’utilisation de Linux à des élèves du secondaire, en langue espagnole"
    },
    {
      "type": "job",
      "title": "Stage de technicien informatique",
      "month": 7,
      "year": 2013,
      "period": "Juillet 2013 - Août 2013",
      "location": "Medellin, Colombia",
      "details": "Stage d’été au sein du département informatique de l’Ecole d’ingénieur d’Antioquia. Organisation de conférence et de cours sur le logiciel libre et maintenance du parc informatique"
    },
    {
      "type": "diploma",
      "title": "Cours en ligne de Machine Learning",
      "month": 11,
      "year": 2014,
      "period": "Novembre 2014",
      "details": "Obtention d’un certificat de Machine Learning délivré par Stanford University après avoir suivi des cours en ligne et réalisé des projets de programmation. Apprentissage des techniques courantes de Machine Learning (SVM, K-Mean, Réseaux de Neurones)"
    },
    {
      "type": "job",
      "title": "Construction d’une voiture radiocommandé autonome",
      "month": 1,
      "year": 2015,
      "period": "Janvier 2015",
      "location": "Evry, France",
      "details": "Asservissement en vitesse et en direction d’une voiture miniature à l’aide d’un microcontrôleur 8 bits, de capteurs et d’actionneurs",
      "anchor": "autonomous-car"
    },
    {
      "type": "project",
      "title": "Projet Challenge d’entreprendre",
      "month": 4,
      "year": 2015,
      "period": "Avril 2015",
      "location": "Evry, France",
      "details": "Projet de création de start-up dans le cadre d’une compétition d’entreprenariat de Telecom SudParis, Telecom Ecole de Management et l’ENSII. Définition d’un business model et écriture d’un executive summary. Qualification en demi-finale (16 projets sur 116)",
      "anchor": "entrepreneurship-competition"
    },
    {
      "type": "job",
      "title": "Développeur Full-Stack @ Linagora",
      "month": 6,
      "year": 2015,
      "period": "Juin 2015 - Spetembre 2015",
      "location": "Paris, France",
      "details": "Stage d’été en développement web. J’ai rejoint une équipe travaillant sur un réseau social d’entreprise utilisant une pile de développement full-JS (MEAN stack). Utilisation de méthodes agiles et d’outils d’intégration continue.",
      "anchor": "openpaas-esn"
    },
    {
      "type": "project",
      "title": "Projet de Recherche Cassiopée",
      "month": 10,
      "year": 2015,
      "period": "Octobre 2015 - Janvier 2016",
      "details": "Participation à une compétition de data science sur la plateforme Kaggle. Prédiction de la nature d’un délit commis à un San Francisco en s’appuyant sur 12 ans d’archive de la police",
      "anchor": "san-francisco"
    },
    {
      "type": "project",
      "title": "Projet de Fin d’Étude",
      "month": 10,
      "year": 2015,
      "period": "Octobre 2015 - Janvier 2016",
      "details": "Implémentation sur une Raspberry Pi d’un protocole de chiffrement asymétrique pour les systèmes contraints basé sur les codes correcteurs d’erreurs. Vous pouvez consulter le <a href=\"https://drive.google.com/file/d/1ZGPOJ9w_sIGEhjBzx9PgtIJ4PTPPIUBE/view?usp=sharing\" target=\"_blank\">rapport du projet</a> en ligne."
    },
    {
      "type": "job",
      "title": "Développeur Logiciel @ Airbus",
      "month": 2,
      "year": 2016,
      "period": "Février 2016 - Août 2016",
      "details": "Conecption d'un outil logiciel à destination des équipe R&D du departement contrôle de vol d'Airbus. L'outil est capable de parser et d'analyser des planches SCADE, utilisées pour le développement des systèmes critiques. Cet outil sert ensuite à detecter d'éventuelles anomalies et permet à l'ingénieur de les résoudre en bureau d'études. Cela permet de gagner du temps puique les erreurs peuvent-être corigées avant qu'elles ne soient détectées lors des test au sol ou des essais en vol. Le logiciel à été développé en C++ en utilisant la bibliothèque QT version 5.",
      "anchor": "flight-controls"
    },
    {
      "type": "job",
      "title": "Consultant Technique @ Altran",
      "month": 1,
      "year": 2017,
      "period": "Janvier 2017 - Septembre 2017",
      "details": "Développeur Full-Stack et consultant technique por les projets IT. J'ai princpalement travaillé sur le projet AGEDI. AGEDI est un logiciel de gestion des paies et de compatabilité à destination de la fontion publique territoriale. La stack technique utilisée était la suivante: J2E/Spring côté serveur, Angular côté client et PostGreSQL comme SGBD. Lors de ce travail en équipe, nous avons également mis en oeuvre une gestion de projet Agile avec la méthode SCRUM, une gestion des versions avec Git et une intégration continue avec Jenkins.",
      "anchor": "agedi"
    }
  ],
  "skills_legend": [
    {
      "stars": 1,
      "label": "Theoretical knowledge",
      "details": "I am aware this technology exists. I read articles about it and I know the concepts and how it works. Though I never experiment it on a project. But I will be very glad to learn it and use it."
    },
    {
      "stars": 2,
      "label": "Basic knowledge",
      "details": "I used this technology in personal and school projects. I am comfortable using it for basic use cases. However I need support or further research to solve more advanced problems"
    },
    {
      "stars": 3,
      "label": "Intermediate knowledge",
      "details": "I used this technology in professional projects. I am autonomous and can get through documentation to solve most of the problems. My experience allow me to avoid current mistakes so I can develop quickly and efficiently."
    },
    {
      "stars": 4,
      "label": "Advanced knowledge",
      "details": "I've used this technology since a long time. I can solve complex problems using it and support people who need help."
    }
  ],
  "skills": [
    {
      "id": 1,
      "title": "Front-end",
      "skills": [
        {
          "id": 1,
          "name": "HTML5",
          "icon": "tech-icon-html5",
          "details": "New best practices with new tags. I generally use preprocessors to make it less verbose (e.g. Pug, EJS, HAML, Handlebars). I also have a good knowledge of Audio and Canvas APIs.",
          "stars": 4,
          "documentation": "https://www.w3schools.com/tags/default.asp",
          "related": [
            {
              "name": "Pug",
              "icon": "tech-icon-pug"
            }
          ]
        },
        {
          "id": 2,
          "name": "CSS3",
          "icon": "tech-icon-css3",
          "details": "Even if using CSS can be frustrating I still love it. I have a strong knowledge (use of advanced selectors, flex positioning, awareness of best practices (BEM, OOCSS). I use preprocessors (Stylus, SASS, LESS) for mixins, includes and more to make the code shorter and clearer.",
          "stars": 4,
          "documentation": "https://www.w3schools.com/tags/default.asp",
          "related": [
            {
              "name": "SASS",
              "icon": "tech-icon-sass"
            },
            {
              "name": "Less",
              "icon": "tech-icon-less"
            },
            {
              "name": "Stylus",
              "icon": "tech-icon-stylus"
            }
          ]
        },
        {
          "id": 3,
          "name": "Javascript",
          "icon": "tech-icon-javascript",
          "details": "I love the Javascript ecosystem which is, in my opinion, one of the most innovative nowadays. It's very rich and evolve quickly, thus Javascript developers have to constantly keep learning new stuffs. Currently using ES6 syntax, I tried several derived languages and supersets such as Typescript or Dart. I'm also comfortable with module bundlers like Webpack or task runners like Gulp or Grunt. The syntax is quite easy and high level but that does not mean Javascript is easy. Rather the opposite, you have to know how the engine works for complex debugging.",
          "stars": 3,
          "documentation": "https://developer.mozilla.org/fr/docs/Web/JavaScript/Reference",
          "related": [
            {
              "name": "Typescript",
              "icon": "tech-icon-typescript"
            },
            {
              "name": "D3JS",
              "icon": "tech-icon-d3"
            },
            {
              "name": "NPM",
              "icon": "tech-icon-npm"
            },
            {
              "name": "Yarn",
              "icon": "tech-icon-yarn"
            },
            {
              "name": "Webpack",
              "icon": "tech-icon-webpack"
            },
            {
              "name": "Grunt",
              "icon": "tech-icon-grunt"
            },
            {
              "name": "Gulp",
              "icon": "tech-icon-gulp"
            }
          ]
        },
        {
          "id": 5,
          "name": "AngularJS",
          "icon": "tech-icon-angularjs",
          "details": "I loved working the good old AngularJS. This was my first real professional JS framework and I really learned to use it properly by making my own directive/services. I couldn't say I'm an expert as the beast is quite big and complex. I always need to keep an eye on the doc to know what it is possible to do with the different components (router, built-in service as $http). Moreover I'm comfortable at unit testing but far less with E2E testing. In the future I would prefer using Angular2+ but I still have the knowledge to maintain legacy AngularJS apps.",
          "stars": 3,
          "documentation": "https://docs.angularjs.org/api"
        },
        {
          "id": 5,
          "name": "Angular",
          "icon": "tech-icon-angular2",
          "details": "I mean Angular2 and beyond here. I definitely love the new versions of the framework. The use of TypeScript make the code more maintainable and clear in my opinion. The integration of RxJS in Angular make async code management smoother and more elegant. Even if I'm a bit novice at it, I'm eager to learn and progress.",
          "stars": 2,
          "documentation": "https://angular.io/api"
        },
        {
          "id": 5,
          "name": "React",
          "icon": "tech-icon-react",
          "details": "I tried react in personal projects and I loved it. Making is own little components and compose them is so satisfying ! The Flux/Redux philosophy is also a great way to manage async code using only pure functions as reducers. I think coding in react make it easier to scale up to complex projects, but I never had the chance to use it in a professional context to verify this. I would be glad if this opportunity would happen in the future.",
          "stars": 2,
          "documentation": "https://reactjs.org/docs/getting-started.html"
        },
        {
          "id": 5,
          "name": "VueJS",
          "icon": "tech-icon-vuejs",
          "details": "I'm very interested by this UI framework. I played a bit with Vue when it was released but I never had the chance to work with it in real project. I really liked the lightweight approach. I feel Vue manage to offer the efficiency of modern UI framework features (virtual DOM, reusable components) while keeping in mind performance.",
          "stars": 1,
          "documentation": "https://vuejs.org/v2/api/"
        },
        {
          "id": 8,
          "name": "Bootstrap",
          "icon": "tech-icon-bootstrap",
          "details": "I used Bootstrap a lot in the past for all kind of projects. I'm used to deal with the grid system and the different CSS and JS components. However, I now prefer material design aesthetically speaking.",
          "documentation": "https://getbootstrap.com/docs/4.1/getting-started/introduction/",
          "stars": 4
        },
        {
          "id": 8,
          "name": "Material Design Lite",
          "icon": "tech-icon-material-design-lite",
          "details": "I know it's subjective but Material Design is my favorite webdesign trend. It's always satisfying to develop beautiful UI. I used several implementations of Google Material Design guidelines. Among them Material Design Lite and MaterializeCSS appears to be the most mature projects.",
          "stars": 3,
          "documentation": "https://getmdl.io/started/index.html"
        }
      ]
    },
    {
      "id": 2,
      "title": "Back-end",
      "skills": [
        {
          "id": 6,
          "name": "Spring",
          "icon": "tech-icon-spring",
          "details": "I discovered Spring and J2E when I worked in Altran. Before that I used ExpressJS or Symphony as back-end framework. I understand now why J2E/Spring is so widely used in the industry. It's very mature technology and it works just perfectly with relational databases thanks to hibernate. IMO, the static typing and the oriented-object aspect of Java force the developer to produce code more rigorously and improve maintainability. Besides, I like the new stream features in Java 8.",
          "stars": 3,
          "documentation": "https://spring.io/guides"
        },
        {
          "id": 7,
          "name": "NodeJS",
          "icon": "tech-icon-node",
          "details": "Isn't it pleasant to use the same programming language server-side and client-side ? Besides the non-blocking IO system handle more request on a single thread than other languages. However, there is less third party library so you have to do more development yourself. That challenging but quite time-wasting. I haven't use NodeJS in a professional context since a long time, so I'll probably need to update but I still love it.",
          "stars": 2,
          "documentation": "https://nodejs.org/en/docs/"
        },
        {
          "id": 9,
          "name": "Web Scrapping",
          "icon": "tech-icon-tag-search",
          "details": "I love building bots scrapping the web and extracting data by parsing HTTP response with RegExp. I use CasperJS to build quickly bots. This awesome lib make the use of cookies, clicks, scrolls and so on easier.",
          "stars": 3,
          "documentation": "http://docs.casperjs.org/en/latest/"
        }
      ]
    },
    {
      "id": "3",
      "title": "Databases",
      "skills": [
        {
          "id": 31,
          "name": "MongoDB",
          "icon": "tech-icon-mongo",
          "details": "The first NoSQL database I used. This document-oriented database allow high scalability but breaks with traditional relational database ease of use and possibility of complex requests.",
          "stars": 2,
          "documentation": "https://docs.mongodb.com/"
        },
        {
          "id": 7,
          "name": "ElasticSearch",
          "icon": "tech-icon-elasticsearch",
          "details": "I used ElasticSearch in professional projects but only as user rather than architect. It means I can index and request documents. Yet, I couldn't deploy and parametrize an elastic search cluster. Well I probably could, but I need to spend time to learn this technology more thoroughly.",
          "stars": 2,
          "documentation": "https://www.elastic.co/guide/index.html"
        },
        {
          "id": 32,
          "name": "SQL",
          "icon": "tech-icon-database",
          "details": "Most of the projects on which I worked use a SQL database. I'm able to build complex requests and optimize performances. I can also design data-models connecting entities with different relationships (one-to-many etc...) and implement the corresponding schema in SQL.",
          "stars": 3,
          "documentation": "http://sql.sh/"
        }
      ]
    },
    {
      "id": "2",
      "title": "Software Development",
      "skills": [
        {
          "id": 1,
          "name": "C/C++",
          "icon": "tech-icon-c",
          "details": "Even though my early career has rather taken the direction of web development, I still have a strong knowledge in C/C++. C was the most used language at university during my specialization in embedded systems. In my opinion, it's important for a programmer to know how to manage the memory. It allows to better understand higher-level language memory management mechanisms (garbage collection, referencing/dereferencing and so on).",
          "stars": 3,
          "documentation": "https://en.cppreference.com/w/"
        },
        {
          "id": 42,
          "name": "QT",
          "icon": "tech-icon-qt",
          "details": "QT is a framework useful to develop a desktop application. It handles both GUI creation and business logic. It also comes with a lot of helpers and collections such as HashMap. Event programming is managed with Observer pattern. I used QT5 during my internship at Airbus and I'm now comfortable using it.",
          "stars": 4,
          "documentation": "http://doc.qt.io"
        },
        {
          "id": 42,
          "name": "Electron",
          "icon": "tech-icon-electron",
          "details": "Electron permits to build desktop applications with the web world technologies (JS/HTML/CSS). I don't have professional experience with electron, but I tried it and I think I could be a productive Electron programmer quickly if I work on it in a professional context.",
          "stars": 1,
          "documentation": "https://electronjs.org/docs"
        }
      ]
    },
    {
      "id": "2",
      "title": "Mobile App Development",
      "skills": [
        {
          "id": 1,
          "name": "Android SDK",
          "icon": "tech-icon-android",
          "details": "I already developed basic Android apps with the official SDK at school. I would be glad to improve my skills by working on a professional project.",
          "stars": 1,
          "documentation": "https://developer.android.com/guide/"
        },
        {
          "id": 2,
          "name": "Ionic",
          "icon": "tech-icon-ionic",
          "details": "Ionic permits to develop hybrid mobile apps. I never tried but I think I could learn it quickly as I already know most of the technologies Ionic is based on (HTML/CSS/JS). I would glad to work with Ionic and I'm thinking of doing a personal project with it.",
          "stars": 1,
          "documentation": "https://ionicframework.com/docs/"
        }
      ]
    },
    {
      "id": "4",
      "title": "Data Analytics",
      "skills": [
        {
          "id": 41,
          "name": "Python",
          "icon": "tech-icon-python",
          "details": "I mainly use Python for machine learning. As far as I know, it's the most suitable tool for this using the awesome library SciPy based on Numpy. Python is useful for data cleaning and processing using the Python API of ML libraries such as Scikit-learn or Tensorflow. I never used Python for web development (Django).",
          "stars": 3,
          "documentation": "https://docs.python.org/3.7/reference/index.html"
        },
        {
          "id": 3,
          "name": "Machine Learning",
          "icon": "tech-icon-brain-outline",
          "details": "Although I'm not an expert, I'm passionate about IA. I learned machine learning basics and I try to stay informed of new things. I worked on several student projects with a good friend now studying IA PhD. I don't have a great expertise of mathematical in and outs, so my approach is a bit empirical. But it often give satisfying results.",
          "stars": 2,
          "documentation": "http://ml-cheatsheet.readthedocs.io"
        },
        {
          "id": 1,
          "name": "R",
          "icon": "tech-icon-r",
          "details": "I mainly use R for data visualisation. It allows me to better understand data and clean it before using it.",
          "stars": 2,
          "documentation": "https://www.r-project.org/"
        },
        {
          "id": 2,
          "name": "Matlab/Octave",
          "icon": "tech-icon-maths-function",
          "details": "I used Matlab a lot as a student for matrix calculation. It now permits me to quickly validate a model before implementing it.",
          "stars": 2,
          "documentation": "https://www.mathworks.com/help/matlab/"
        },
        {
          "id": 2,
          "name": "Tensorflow",
          "icon": "tech-icon-tensorflow",
          "details": "Tensorflow is a Deep learning library that make easier the use deep neural networks. I used it at school for handwritten digits recognition (MNIST database) and during the project Kaggle SF Crimes Classification.",
          "stars": 2,
          "documentation": "https://www.tensorflow.org/"
        },
        {
          "id": 2,
          "name": "ScikitLearn",
          "icon": "tech-icon-artificial-intelligence",
          "details": "Great library for numerous machine learning techniques, supervised and unsupervised: SVN, K-Mean, Logistic Regressions. Also provide good helpers for pre-processing.",
          "stars": 2,
          "documentation": "http://scikit-learn.org/stable/"
        }
      ]
    },
    {
      "id": 5,
      "title": "Embedded Systems",
      "skills": [
        {
          "id": 1,
          "name": "Assembly Language",
          "icon": "tech-icon-random-access-memory-chip",
          "details": "I used this low-level language to program 8 bits micro-controllers during school projects. Long jump to projects section for more details ;-)",
          "stars": 2,
          "documentation": "http://ref.x86asm.net/"
        },
        {
          "id": 2,
          "name": "Raspberry",
          "icon": "tech-icon-raspberry",
          "details": "I am the proud owner of a Raspberry Pi 3 Model B. I've turned it in bluetooth audio system. Plug the jack in your hifi stereo and pair your phone: you have a DIY bluetooth speaker at home. I also implemented an asymmetric cyphering protocol on a raspberry for my Engineer’s degree final project.",
          "stars": 3,
          "documentation": "https://www.raspberrypi.org/documentation/"
        },
        {
          "id": 1,
          "name": "Real-Time Computing",
          "icon": "tech-icon-clock",
          "details": "I have theoretical knowledge of critic systems. I can solve problems such as how to schedule jobs to respect real time constraints.",
          "stars": 1
        }
      ]
    },
    {
      "id": "5",
      "title": "Workflow",
      "skills": [
        {
          "id": 1,
          "name": "Git",
          "icon": "tech-icon-git",
          "details": "My favourite source code management tool. I know all the basics and some more advanced concepts and commands (hooks, reflog, partial adds, interactive rebase to edit commits historic). I try my best to have a clean historic with atomic commits event if it sometimes hard to achieve when coding fast.",
          "stars": 4,
          "documentation": "https://git-scm.com/book/en/v2"
        },
        {
          "id": 2,
          "name": "Agile methods",
          "icon": "tech-icon-jira",
          "details": "I am an Agile enthusiast. The method I used the most is SCRUM. I also know concepts of other methods like Xtrem Programming (XP). I used different tools within the projects I contributed. The proprietary software JIRA and then open-source solutions Tuleap and Taiga.",
          "stars": 3,
          "documentation": "https://www.scrumguides.org/scrum-guide.html"
        },
        {
          "id": 3,
          "name": "Continuous Integration",
          "icon": "tech-icon-jenkins",
          "details": "I can deploy a continuous integration server with Jenkins. When code is merged on master branch in the project's git repository, a build is automatically triggered. Then the new version is deployed unless unit tests are broken.",
          "stars": 2,
          "documentation": "https://jenkins.io/doc/"
        },
        {
          "id": 5,
          "name": "UML",
          "icon": "tech-icon-compas",
          "details": "During the conception phase of a software, I use to draw UML diagrams (class diagram, state machine diagram, activity diagram and so on) to better understand what I have to implement before coding it. It's also an universal method to communicate between developers.",
          "stars": 3
        },
        {
          "id": 5,
          "name": "Unit Testing",
          "icon": "tech-icon-two-test-tubes",
          "details": "Unit testing is important to avoid regression and gain time on medium to large projects. I've already written jUnit tests in a spring environment and Javascript unit tests using dedicated libraries (Mocha, Karma, Jasmine). However I'm novice to E2E testing and I would like to progress on this point.",
          "stars": 3
        }
      ]
    },
    {
      "id": "6",
      "title": "Design",
      "skills": [
        {
          "id": 2,
          "name": "Adobe Illustrator",
          "icon": "tech-icon-illustrator",
          "details": "Well, I'm not an artist but I have some skills in vectorial drawing. I can produce graphical resources for a project without dedicated graphic designer.",
          "stars": 2
        },
        {
          "id": 3,
          "name": "Adobe InDesign",
          "icon": "tech-icon-indesign",
          "details": "Same as above. I can produce decent documents with InDesign. Still less austere than a word document.",
          "stars": 2
        }
      ]
    },
    {
      "id": "7",
      "title": "Systems Administration",
      "skills": [
        {
          "id": 3,
          "name": "TCP/IP Networks",
          "icon": "mdi mdi-earth",
          "details": "Thanks to my studies, I have a good theoretical knowledge about routing, DNS, model OSI and so on.",
          "stars": 1
        },
        {
          "id": 2,
          "name": "Servers Adminstration",
          "icon": "tech-icon-server-alt",
          "details": "I'm not precisely a sysadmin. Though I can deploy web applications in production, manage logs, document configuration of the system etc...",
          "stars": 2
        },
        {
          "id": 1,
          "name": "Unix",
          "icon": "tech-icon-linux",
          "details": "I'm very comfortable with Linux operating systems and unix commands. My favorite shell is ZSH. I like creating shell scripts to automate repetitive tasks. The main distribution I used for production servers are Debian and CentOS.",
          "stars": 4
        }
      ]
    },
    {
      "id": "8",
      "title": "Miscellaneous",
      "skills": [
        {
          "id": 1,
          "name": "LaTeX",
          "icon": "tech-icon-tex",
          "details": "The best way to produce scientific documents. Way more complete and robust than classical word processing programs. I used it during all my scholarship.",
          "stars": 3
        },
        {
          "id": 2,
          "name": "PCRE Regex",
          "icon": "tech-icon-regex",
          "details": "A good developer has to know how to build complex regular expression. I use the excellent <a target=\"__blank\" href=\"https://regexr.com\">RegExr</a> to validate my RegExp.",
          "stars": 4
        }
      ]
    }
  ],
  "projects": [
    {
      "title": "Pictrip",
      "anchor": "agedi",
      "skills": [
        {
          "name": "J2E",
          "icon": "tech-icon-java"
        },
        {
          "name": "Spring",
          "icon": "tech-icon-spring"
        },
        {
          "name": "Angular 2+",
          "icon": "tech-icon-angular2"
        },
        {
          "name": "HTML5",
          "icon": "tech-icon-html5"
        },
        {
          "name": "CSS3",
          "icon": "tech-icon-css3"
        },
        {
          "name": "Material Design",
          "icon": "tech-icon-material-design-lite"
        },
        {
          "name": "Webpack",
          "icon": "tech-icon-webpack"
        },
        {
          "name": "Google Maps API",
          "icon": "tech-icon-map"
        },
        {
          "name": "SQL",
          "icon": "tech-icon-database"
        },
        {
          "name": "Git",
          "icon": "tech-icon-git"
        }
      ],
      "begin-date": "August 2017",
      "end-date": "September 2017",
      "details": "A side project I began to develop before my trip in South-East Asia. Unfortunately I didn't have time to finish it. The idea was to build a single page app that allow the user to draw his trip on the world map. The user can add step and connect them by precising the transportation mode used. At each step he can upload pictures. The project was scaffold using jHipster, a nice tool that generate the backbone of an Spring/Angular4 project. As I said I didn't finish it, but it was a good exercise. I updated my skills on angular4, learned TypeScript, created my data-model and played with GoogleMaps API. I released the source code on <a target=\"_blank\" href=\"https://github.com/MarioArnt/pictrip\">Github</a>. Maybe I'll finish it one day."
    },
    {
      "title": "AGEDI Accounting and Payrol",
      "anchor": "agedi",
      "skills": [
        {
          "name": "J2E",
          "icon": "tech-icon-java"
        },
        {
          "name": "Spring",
          "icon": "tech-icon-spring"
        },
        {
          "name": "AngularJS",
          "icon": "tech-icon-angularjs"
        },
        {
          "name": "Gulp",
          "icon": "tech-icon-gulp"
        },
        {
          "name": "HTML5",
          "icon": "tech-icon-html5"
        },
        {
          "name": "CSS3",
          "icon": "tech-icon-css3"
        },
        {
          "name": "Bootstrap",
          "icon": "tech-icon-bootstrap"
        },
        {
          "name": "SQL",
          "icon": "tech-icon-database"
        },
        {
          "name": "Git",
          "icon": "tech-icon-git"
        },
        {
          "name": "Agile Methods",
          "icon": "tech-icon-jira"
        },
        {
          "name": "Continuous Integration",
          "icon": "tech-icon-jenkins"
        }
      ],
      "begin-date": "January 2017",
      "end-date": "September 2017",
      "details": "AGEDI is a project develop by Altran South-West. I was working as full stack developer. We used the following stack: Spring as back-end framework, AngularJS as front-end framework. The database was a SQL database. It was a very interesting project. With my teammates we've had a lot of interesting-to-solve problems. In the beginning, I thought it will be just some CRUD app, nothing that challenging. But the French administration payroll and accounting rules are really wicked and this distinctiveness brought some complex problems. I also learnt more general things, like managing timezones or use a multi-tenant database architecture, which will be useful in the future. I am thankful to my former more experimented colleagues that gave me valuable advice and tips. For the project management side, we used a SCRUM tool called Tuleap, which is not my favourite, but still ergonomic enough."
    },
    {
      "title": "Flight Controls Anomalies Detection tools",
      "anchor": "flight-controls",
      "skills": [
        {
          "name": "C/C++",
          "icon": "tech-icon-c"
        },
        {
          "name": "QT",
          "icon": "tech-icon-qt"
        },
        {
          "name": "Agile Methods",
          "icon": "tech-icon-jira"
        }
      ],
      "begin-date": "February 2016",
      "end-date": "September 2016",
      "details": "This software was developed during my end of studies internship at Airbus. My missions were multiple. First I had to meet the research and development team responsible of designing the part of software dedicated for flight controls which is embedded in Airbus aircafts. We identified together various needs which required the development of a specific tool that did not exist yet at Airbus. Airbus engineers worked with SCADE sheets. SCADE (Safety Critical Application Development Environment) is an integrated development environment intended for the design of critical systems. The needed a tool that permits to detect several anomalies (inconsistencies between I/O signals) and improved navigation in sheets collections (for instance find upstream signals). I set-up an Agile tool, Taiga, and began to fill the product backlog with the user stories related to these needs. Then I started development using QT library, which was, at Airbus, the predominant technology for internal software. I meet regularly the team for which the software is intended to make the backlog evolve with their new needs and feedback. The software was composed of many software bricks including, among others, a SCADE sheet parsing engine and an analysis engine. The analysis engine was a very interesting aspect as it required graph theory and recursive algorithms. The software was developed in six months and filled most of the targeted features."
    },
    {
      "title": "San Francisco Crime Classification",
      "anchor": "san-francisco",
      "link": "http://kaggle.com/SF",
      "skills": [
        {
          "name": "R",
          "icon": "tech-icon-r"
        },
        {
          "name": "Machine Learning",
          "icon": "tech-icon-brain-outline"
        },
        {
          "name": "Python",
          "icon": "tech-icon-python"
        },
        {
          "name": "Scikit Learn",
          "icon": "tech-icon-artificial-intelligence"
        },
        {
          "name": "Tensorflow",
          "icon": "tech-icon-tensorflow"
        }
      ],
      "begin-date": "October 2015",
      "end-date": "January 2016",
      "details": "Avec un ami de Télécom SudParis nous partcipons à une compétition de Machine Learning sur la plateforme de data science kaggle. Le but du projet est de prédire la catégorie d'un délit qui a eu lieu à San Francsico en se basant sur 12 ans d'archive de la police. Les données dont nous disposons sont multiples et variées: coordonnées GPS, adresse exacte, date et heure et bien plus. Nous avons développé des scripts de visualisation spatiale et temporelle des données grâce au langage R et nous allons mettre en place, après avoir traité les données en amont, différentes techniques de machine learning supervisé et non-supervisé afin d'effectuer nos prédictions. Plus d'information sur la compétition <a href=\"https://www.kaggle.com/c/sf-crime/\">sur le site internet de Kaggle</a>. Vous pouvez également consulter le <a href=\"https://drive.google.com/file/d/1LkL5VjEi8jOQi6MAuvvQu5MQ66W5cu8B/view?usp=sharing\" target=\"blank\">rapport de projet.</a>"
    },
    {
      "title": "Student Office Campaign Website",
      "anchor": "student-office-website",
      "link": "",
      "skills": [
        {
          "name": "HTML5",
          "icon": "tech-icon-html5"
        },
        {
          "name": "CSS3",
          "icon": "tech-icon-css3"
        },
        {
          "name": "Javascript",
          "icon": "tech-icon-javascript"
        },
        {
          "name": "PHP",
          "icon": "tech-icon-php"
        },
        {
          "name": "Symfony",
          "icon": "tech-icon-symfony"
        },
        {
          "name": "SQL",
          "icon": "tech-icon-database"
        }
      ],
      "begin-date": "November 2012",
      "end-date": "January 2013",
      "details": "Lors de élections du Bureau des Elèves de Télécom SudParis, j'ai réalisé le site internet vitrine de notre liste. Les technologies utilisé sont PHP allié au framwork Symfony pour le backend, PostgreSQL comme SGBD et HTML5/CSS3 pour le frontend avec l'utilisation de la librairie jQuery pour l'interactivité côté client et les communications serveur asynchrones via des requêtes AJAX."
    },
    {
      "title": "Autonomous Remote-Controlled Car",
      "anchor": "autonomous-car",
      "link": "",
      "skills": [
        {
          "name": "A51 Assembly language",
          "icon": "tech-icon-random-access-memory-chip"
        }
      ],
      "begin-date": "Fevrier 2015",
      "end-date": "",
      "details": "Dans le cadre d'un projet d'électronique embarquée et de programmation bas-niveau à Télécom SudParis, nous avons mis au point une voiture miniature autonome. La voiture, radiocommandée à la base, disposait d'un moteur et de servo-moteurs commandables par modulation de largeur d'impulsion (PWM). Nous avons asservi en vitesse et en direction la voiture afin qu'elle suive une piste de course. Des capteurs optiques permettaient de determiner la position de la voiture. L'information des capteurs était transmise à un micro-contrôlleur 8 bits calculant en temps rééls les actions à mener sur le moteur et les servomoteurs de direction. La programmation de notre algorithme d'asservissement à été effectué en langage d'assemblage."
    },
    {
      "title": "Entrepreneurship Competition",
      "link": "",
      "anchor": "entrepreneurship-competition",
      "skills": [
        {
          "name": "Photoshop",
          "icon": "tech-icon-photoshop"
        },
        {
          "name": "Illustrator",
          "icon": "tech-icon-illustrator"
        },
        {
          "name": "After Effect",
          "icon": "tech-icon-after-effect"
        },
        {
          "name": "InDesign",
          "icon": "tech-icon-indesign"
        }
      ],
      "begin-date": "October 2015",
      "end-date": "January 2016",
      "details": "Participation à la compétition de création d'entreprises \"Challenge d'entreprendre\" de Télécom SudParis, Télécom Ecole de Management, et ENSIIE. Avec un équipe mixte, trois ingénieurs et deux managers, nous avons disposé d'une semaine pour imaginer un concept innovant débouchant sur la création d'une start-up économiquement viable. Notre idée à été de creer un comparateur de transport terrestre, regroupant bus, train et covoiturage, à l'instar de ce qui existe déjà pour le transport aérien. Nous avons travaillé sur le business model de l'entreprise et la communication auprès d'éventuels investisseurs en réalisant une vidéo de 8 minutes expliquant le besoin, le concept, l'état du marché, le contexte économique et le business plan. Notre projet à été qualifié pour les demi-finales parmis plus d'une centaine de projets."
    },
    {
      "title": "OpenPaaS - Entreprise Social Network",
      "anchor": "openpaas-esn",
      "link": "http://open-paas.org/",
      "skills": [
        {
          "name": "Javascript",
          "icon": "tech-icon-javascript"
        },
        {
          "name": "MongoDB",
          "icon": "tech-icon-mongo"
        },
        {
          "name": "ExpressJS",
          "icon": "tech-icon-express"
        },
        {
          "name": "AngularJS",
          "icon": "tech-icon-angularjs"
        },
        {
          "name": "NodeJS",
          "icon": "tech-icon-node"
        },
        {
          "name": "HTML5",
          "icon": "tech-icon-html5"
        },
        {
          "name": "CSS3",
          "icon": "tech-icon-css3"
        },
        {
          "name": "Git",
          "icon": "tech-icon-git"
        },
        {
          "name": "Jira",
          "icon": "tech-icon-jira"
        },
        {
          "name": "Jenkins",
          "icon": "tech-icon-jenkins"
        },
        {
          "name": "Server Adminstration",
          "icon": "tech-icon-server-alt"
        }
      ],
      "begin-date": "June 2015",
      "end-date": "September 2015",
      "details": "Le projet open-paas à l'ambition de rivaliser avec les plus grands acteurs commerciaux du réseau social d'entreprise. Entièrement open-source, le but est aussi pour les entreprises et les administrations de remettre la main sur le contrôle de leurs données. En plus des fonctions classique et essentielles pour la productivité en entreprise (calendrier, mail, contact), le produit met en place des concepts sociaux pour la collaboration: communautés, likes, commentaires, partages. De plus un système de recommendation abouti devrait aider la collaborateur à faire le tri des informations pertinentes pour lui. Enfin un service de visio-conférence directement dans le navigateur et sans plugin, <a href=\"http://hubl.in/\">hubl.in</a> lui est associé. Retrouvez le code source du <a href=\"https://github.com/linagora/openpaas-esn\">réseau social d'entreprise</a> et de <a href=\"https://github.com/linagora/hublin\">hubl.in</a> sur Github"
    }
  ]
}
